[
	{
		"title": "<a>Laravel 5.3 telah dirilis! Datang membawa fitur luar biasa.</a>",
		"photo": "assets/img/laravellogo.jpg",
		"article": "Laravel merupakan framework PHP yang sangat powerful dan kaya akan fitur. Framework ini merupakan framework PHP yang baru, namun karena fungsi nya yang sangat bagus, maka dapat langsung diterima di kalangan para Web Developer PHP. Sampai saat ini, Laravel sudah mencapai versi 5.3. Laravel 5.3 resmi dirilis tanggal 23 Agustus kemarin. Fitur-fitur baru difokuskan pada peningkatan kecepatan developer dalam melakukan pekerjaan-pekerjaan yang umumnya dilakukan dalam pengembangan aplikasi.<br><br>Berikut adalah fitur-fitur terbaru:<br><br>Laravel Scout, Fitur full-text search engine untuk model Eloquent. Secara otomatis Scout dapat menyimpan indeks pencarian secara sinkron dengan Eloquent records.<br>Laravel Passport, dirancang untuk membuat otentikasi API, memberikan berbagai kebutuhan untuk menggunakan server OAuth2 sendiri dengan cepat.<br>Laravel Mailable, fitur ini menyederhanakan cara pengiriman email dengan membuat class “mailable” yang menangani pengaturan email.<br>Laravel Notifications, digunakan dalam pengiriman berbagai update dengan cepat melalui service seperti Slack, pesan teks, email dan layanan lain.<br>Laravel Echo, fitur ini membuat Laravel Event di-broadcast melalui koneksi WebSocket, memungkinkan berbagi event yang sama antara kode server-side dengan kode client-side aplikasi JavaScript.<br>Fitur lainnya berupa peningkatan pada fitur Migration, Pagination, Blade, Queued Jobs, Query Builder, dan Cache helper yang dapat dilihat di Laravel News."
	},
	{
		"title": "<a>Berkenalan dengan teknologi WebSocket</a>",
		"photo": "assets/img/websocketlogo.png",
		"article": "WebSocket adalah standar baru untuk komunikasi realtime pada Web dan aplikasi mobile. WebSocket dirancang untuk diterapkan di browser web dan server web, tetapi dapat digunakan oleh aplikasi client atau server. WebSocket adalah protokol yang menyediakan saluran komunikasi full-duplex melalui koneksi TCP tunggal.WebSocket merupakan bagian dari HTML5. WebSocket menghadirkan pengurangan besar dalam lalu-lintas jaringan yang tidak penting dan latency dibandingkan dengan solusi polling dan long-polling yang telah digunakan untuk mensimulasikan koneksi dua arah dengan cara menjaga dua koneksi tetap terhubung.Teknologi Comet.<br><br>Sebelum Websocket dibuat, sudah ada teknologi serupa yang dinamakan Comet. Comet adalah model aplikasi Web yang memungkinkan server web untuk mengirim data ke browser klien tanpa harus mengirimkan rekues terlebih dahulu. Comet menjadi istilah umum untuk teknik mencapai interaksi client-server seperti tersebut. Comet dikenal dengan nama lain seperti Ajax Push, Reverse Ajax, Two-way-web, HTTP Streaming dan HTTP server push. Teknik ini bergantung pada teknologi browser asli seperti JavaScript dan tidak menggunakan properti plug-in lain. Namun salahsatu kekurangan dari Comet adalah implementasi yang nontrivial, dan beban dari HTTP header dan TCP handshake yang tidak efisien untuk pesan-pesan yang kecil. Dari kekurangan itulah dikembangkan protokol websocket.<br>Kapan WebSocket Pertama Kali Di temukan ?<br><br>WebSocket pertama kali dirujuk sebagai TCP Connection dalam spesifikasi HTML5, sebagai tempat untuk berbasis TCP socket API. Pada bulan Juni 2008, Nama WebSocket diciptakan oleh Ian Hickson dan Michael Carter, serangkaian diskusi yang dipimpin oleh Michael Carter yang mengakibatkan versi pertama dari protokol dikenal sebagai WebSocket.<br><br>Manfaat WebSocket<br><br>Websocket memungkinkan server untuk mendorong data kepada klien yang terhubung. Mengurangi traffic atau lalu lintas jaringan yang tidak perlu dan latency menggunakan full duplex melalui koneksi tunggal.<br><br>Streaming melalui proxy dan firewall, mendukung komunikasi simultan hulu dan hilir. Kompatibel dengan pre-WebSocket dunia dengan cara beralih dari koneksi HTTP ke WebSockets. Permasalah yang di selesaikan dengan adanya “WebSocket”<br><br>Latar belakang yang mendasari terciptanya websocket adalah permintaan beberapa client yang mengharuskan developer bisa membuat aplikasi berbasis web secara real time atau real-time apps. Aplikasi real time adalah dimana ketika ada perubahan data, maka saat itu juga website di browser klien juga ada perubahan atau setidaknya muncul notifikasi. Ada alternatif lain untuk permasalahan developer tersebut, diantaranya adalah metode polling dan long polling.<br><br>Metode polling ini mengirimkan request data ke server secara terus menerus. Kalau hanya satu client yang melakukan request berulang seperti itu, mungkin tidak masalah, tapi bagaimana jika ada beberapa client yang mengakses satu server dan berulangkali melakukan metode Polling. Maka server akan jadi sibuk dan rentan terkena serangan DDOS.<br><br>Metode long polling adalah metode polling dengan interval waktu yang berkala. Jadi request tidak sesering metode Polling. Manfaatnya adalah server jauh lebih stabil dibandingkan dengan metode polling. Namun permasalahannya sederhana, Long Polling tidak menjawab real time, karena ada interval waktu yang digunakan.Websocket muncul pada tahun 2009 sebagai proposal, kemudian dikembangkan selama 3 tahun sehingga WebSocket sekarang jauh lebih stabil dan sudah banyak di-support oleh bermacam-macam browser."
	},
	{
		"title": "<a>Mengenal Pemrograman Ruby on Rails</a>",
		"photo": "assets/img/railslogo.png",
		"article": "Ruby adalah bahasa pemrograman berorientasi object yang dibuat oleh Yukihiro Matsumoto (Matz) pada tahun 2000. Ruby dapat digunakan di berbagai sistem operasi Linux, MacOs, dan Windows, dikembangkan secara open source. Setiap orang boleh menggunakan Ruby secara gratis, dan juga bebas untuk menduplikat, mendistribusikan bahkan melakukan perubahan / modify !<br><br>Rails merupakan web framework yang dibuat dengan bahasa pemrograman Ruby, dikembangkan pertama kali oleh David Heinemeier Hansson pada tahun 2003.  Rails juga open source tapi dengan lisensi MIT.<br><br>Rails menggunakan konsep MVC, singkatan dari Model View Controller, sehingga memudahkan programmer dalam melakukan manajemen codes. Silakan baca mengenai MVC arsitektur di Penjelasan MVC menurut Wikipedia.<br><br>Kemudian, kenapa sih banyak programmer yang menggunakan Ruby on rails sekarang ini ?<br><br>Berikut ini adalah alasan - alasan utamanya menurut kami:<br><br>Dirancang untuk memudahkan programmer melakukan konfigurasi karena Ruby on Rails menggunakan prinsip Convention Over Configuration. Dengan prinsip ini programmer tidak usah terlalu repot untuk melakukan seting aplikasi seperti koneksi ke database, karena sudah ada mekanisme yang disediakan dan cukup mudah karena tinggal mengisi nama tipe server database yang digunakan ( mysql / oracle / sql server / postgresql / etc ), mengatur nama database, username, password dan host.<br>Menggunakan prinsip DRY ( Do not Repet Yourself ), yang intinya adalah efisiensi dalam manajemen codes.Mempunyai komunitas yang besar, dengan 2500++ kontributor resmi dan 41.000++ gems / plugin yang dibuat. Gem / Plugin bisa dikatakan sebagai external library yang bisa dimasukan ke aplikasi. Dengan besarnya komunitas ini, maka programmer memiliki banyak pilihan solusi ketika menghadapai permasalah. Kemudian, dengan banyaknya gems / plugins tersebut, programmer dapat lebih menghemat waktu development lagi karena tidak usah selalu membuat aplikasi dari awal, tapi bisa memanfaatkan gems / plugins tersebut sesuai keperluan.<br>Sudah terintegrasi dengan ORM library yang beranama ActiveRecord, sehingga untuk melakukan query ke database lebih mudah. Misalnya kita punya table users dan model User, maka untuk menampilkan semua data dari table users cukup dengan User.all<br>Memiliki Sintax yang simple tapi elegan."
	}
]