[
	{
		"title": "<a>Angular JS 2 telah rilis! Framework Javascript yang sangat powerful</a>",
		"photo": "assets/img/angularlogo.png",
		"article": "Google telah merilis versi lanjut dari framework javascript andalan mereka, AngularJS. Telah rilis versi ke 2 dari AngularJS dengan membawa berbagai fitur baru yang dapat di implementasikan dalam website modern masa kini. AngularJS merupakan framework javascript yang kaya akan fitur, ini merupakan framework javascript yang paling popular yang digunakan.<br><br>AngularJS dapat digunakan untuk memaksimalkan user interface (UI) pada sistem yang dibuat. Khususnya pada pembuatan Single Page Application (SPA), sangat direkomendasikan untuk menggunakan framework ini.<br><br>Fitur :<br><br><h2>Cross Platform</h2><h3>Progressive Web Apps</h3>Gunakan kemampuan platform web modern untuk memberikan pengalaman aplikasi-seperti. Kinerja tinggi, offline, dan instalasi nol-langkah.<br><br><h3>Native</h3> Membangun aplikasi mobile asli dengan strategi dari Ionic Framework, NativeScript, dan Bereaksi asli.<br><br><h3>Dekstop</h3>Membuat aplikasi desktop yang terpasang di Mac, Windows, dan Linux menggunakan metode sudut yang sama yang telah Anda pelajari untuk web ditambah kemampuan untuk mengakses API IOS asli.<br><br> <h2>Speed and Performance</h2><h3>Code Generation</h3>Angular membantu memudahkan template Anda ke dalam kode yang sangat dioptimalkan untuk JavaScript mesin virtual saat ini, memberikan Anda semua manfaat dari kode yang ditulis tangan dengan produktivitas kerangka.<br><br><h3>Universal</h3>Sajikan pandangan pertama aplikasi Anda pada node.js, NET, PHP, dan server lainnya untuk instant dekat-render hanya HTML dan CSS. Juga membuka jalan untuk situs yang mengoptimalkan untuk SEO.<br><br><h3>Code Splitting</h3>Aplikasi Angular memuat cepat dengan Komponen Router baru, yang memberikan otomatis kode-membelah sehingga pengguna hanya kode beban yang diperlukan untuk membuat tampilan mereka meminta.<br><br><h2>Productivity</h2><h3>Templates</h3>Cepat membuat tampilan UI dengan sintaks template sederhana dan kuat.<br><br><h3>Angular CLI</h3>Command Line tool: mulai membangun cepat, menambahkan komponen dan tes, kemudian langsung menyebarkan.<br><br><h3>IDEs</h3>Dapatkan kode selesai cerdas, kesalahan instan, dan umpan balik lain dalam editor populer dan IDE.<br><br>"
	},
	{
		"title": "<a>React! Framework Javascript dari Facebook untuk User Interface</a>",
		"photo": "assets/img/reactlogo.png",
		"article": "React merupakan framework javascript untuk membuat UIS interaktif. Desain tampilan sederhana untuk setiap negara dalam aplikasi Anda, dan Bereaksi efisien akan memperbarui dan membuat hanya komponen yang tepat ketika perubahan data Anda. Deklaratif Views membuat kode Anda lebih dapat diprediksi dan lebih mudah untuk debug.<br><br><h3>Component Based</h3>Membangun komponen terenkapsulasi untuk mengelola project mereka sendiri, kemudian membuat komponen tersebut untuk membuat UIS kompleks. Karena logika komponen ditulis dalam JavaScript bukannya template, Anda dapat dengan mudah melewatkan data yang kaya melalui aplikasi Anda dan menjaga project dari DOM.<br><br><h3>Learn Once, Write Anywhere</h3>Kami tidak membuat asumsi tentang sisa kumpulan teknologi Anda, sehingga Anda dapat mengembangkan fitur baru di React tanpa menulis ulang kode yang ada. React juga dapat membuat pada server menggunakan Node dan kekuatan aplikasi mobile menggunakan bereaksi asli.<br><br>"
	},
	{
		"title": "<a>Mengenal Single Page Application (SPA)</a>",
		"photo": "assets/img/spaback.jpg",
		"article": "Apa itu Single Page Application (SPA)? Single page application (SPA) adalah istilah untuk aplikasi berbasis web, yang menggunakan satu halaman web saja sebagai tampilan dari aplikasinya. Semua aksi klik atau pun penyajian data tidak akan membuat halaman secara utuh dimuat ulang (reload), tetapi hanya sebagian-sebagian saja yang diupdate dari server atau dari hasil proses aplikasi di sisi klien.<br><br>Kunci dari aplikasi single page adalah pemrograman dengan teknik AJAX, dengan banyak bermain dengan menggunakan aplikasi client side untuk mengupdate data dari server. <br><br>Dengan menggunakan AJAX, maka beban server dan juga lalu lintas data menjadi lebih kecil. Mengapa? Karena dengan teknik AJAX, hanya data yang diperlukan saja yang akan dikirimkan kepada klien dari server. Di sisi server, beban kerja juga akan menjadi lebih rendah, karena hanya sedikit data yang yang harus diberikan kepada klien. Jika sebelumnya, setiap halaman yang diminta, server akan memberikan banyak file, kini hanya data yang diperlukan saja yang akan dikirimkan.<br><br>Kita harus menggunakan framework yang bisa mendukung pengembangan aplikasi single page ini, terutama untuk menampilkan tampilan aplikasi. Kita harus menggunakan template HTML, CSS, dan JavaScript yang benar-benar baik dan tangguh.<br><br>Berikut adalah beberapa framework client-side yang diperlukan untuk memudahkan pembuatan aplikasi single page:<br>AngularJS<br>Director<br>Sammyjs<br>Backbone.js<br>scaleApp<br>Spine.js<br>JavaScriptMVC<br>SproutCore<br>Ember.js<br>knockout.js<br>PureMVC<br>"
	}
]