[
	{
		"title": "<a>Mengenal Pemrograman Python</a>",
		"photo": "assets/img/pythonblogo.png",
		"article": "Python adalah bahasa pemrograman interpretatif multiguna. Tidak seperti bahasa lain yang susah untuk dibaca dan dipahami, python lebih menekankan pada keterbacaan kode agar lebih mudah untuk memahami sintaks. Hal ini membuat Python sangat mudah dipelajari baik untuk pemula maupun untuk yang sudah menguasai bahasa pemrograman lain.<br><br>Bahasa ini muncul pertama kali pada tahun 1991, dirancang oleh seorang bernama Guido van Rossum. Sampai saat ini Python masih dikembangkan oleh Python Software Foundation. Bahasa Python mendukung hampir semua sistem operasi, bahkan untuk sistem operasi Linux, hampir semua distronya sudah menyertakan Python di dalamnya.<br><br>Dengan kode yang simpel dan mudah diimplementasikan, seorang programmer dapat lebih mengutamakan pengembangan aplikasi yang dibuat, bukan malah sibuk mencari syntax error.<br><br>Dengan sintaks yang simpel, sederhana dan dokumentasi yang lengkap membuat Python menjadi bahasa pemrograman yang mudah untuk dipelajari.<br><br>Dengan sintaks yang simpel, sederhana dan dokumentasi yang lengkap membuat Python menjadi bahasa pemrograman yang mudah untuk dipelajari<br><br>Dengan pendekatan Pemrograman Berorientasi Objek, Python adalah bahasa yang powerful. Belum lagi dengan fitur yang melimpah, library yang luas, komunitas yang besar dan masih banyak hal lainya.<br><br>Bahasa yang efektif adalah bahasa yang dapat disampaikan dan ditangkap dengan cepat. Dengan kelebihan tersebut programmer akan lebih fokus pada pengembangan aplikasi.<br><br>."
	},
	{
		"title": "<a>Mengenal UML. Design dan Analysis Sistem.</a>",
		"photo": "assets/img/umllogo.png",
		"article": "A. Penjelasan UML<br><br>Apa itu UML? Yang dimaksud dengan UML adalah UML merupakan singkatan dari “Unified Modelling Language” yaitu suatu metode permodelan secara visual untuk sarana perancangan sistem berorientasi objek, atau definisi UML yaitu sebagai suatu bahasa yang sudah menjadi standar pada visualisasi, perancangan dan juga pendokumentasian sistem software. Saat ini UML sudah menjadi bahasa standar dalam penulisan blue print software.<br><br>B. Tujuan atau fungsi dari penggunaan UML<br><br>Inilah beberapa tujuan atau fungsi dari penggunaan UML, yang diantaranya:<br>Dapat memberikan bahasa  permodelan visual kepada pengguna dari berbagai macam pemerograman maupun proses rekayasa.Dapat menyatukan praktek-praktek terbaik yang ada dalam permodelan.Dapat memberikan model yang siap untuk digunakan, merupakan bahasa permodelan visual yang ekspresif untuk mengembangkan sistem dan untuk saling menukar model secara mudah. Dapat berguna sebagai blue print, sebab sangat lengkap dan detail dalam perancangannya yang nantinya akan diketahui informasi yang detail mengenai koding suatu program.Dapat memodelkan sistem yang berkonsep berorientasi objek, jadi tidak hanya digunakan untuk memodelkan perangkat lunak (software) saja.Dapat menciptakan suatu bahasa permodelan yang nantinya dapat dipergunakan oleh manusia maupun oleh mesin.<br><br>Apa itu UML (Unified Modelling Language)?C. Jenis-Jenis diagram UML dan beberapa contoh diagramnya<br><br>a. Use case diagram<br>Use case diagram yaitu salah satu jenis diagram pada UML yang menggambarkan interaksi antara sistem dan aktor, use case diagram juga dapat men-deskripsikan tipe interaksi antara si pemakai sistem dengan sistemnya.<br><br>b. Activity Diagram<br>Activity diagram atau diagram aktivitas yaitu salah satu jenis diagram pada UML yang dapat memodelkan proses-proses apa saja yang terjadi pada sistem.<br><br>c. Sequence diagram<br>Sequence diagram yaitu salah satu jenis diagram pada UML yang menjelaskan interaksi objek yang berdasarkan urutan waktu, sequence diagram juga dapat menggambarkan urutan atau tahapan yang harus dilakukan untuk dapat menghasilkan sesuatu seperti pada use case diagram.<br><br>d. Class diagram<br>Class diagram yaitu salah satu jenis diagram pada UML yang digunakan untuk menampilkan kelas-kelas maupun paket-paket yang ada pada suatu sistem yang nantinya akan digunakan. Jadi diagram ini dapat memberikan sebuah gambaran mengenai sistem maupun relasi-relasi yang terdapat pada sistem tersebut.<br><br>e. Statemachine diagram<br>Statemachine diagram yaitu salah satu jenis diagram pada UML yang menggambarkan transisi maupun perubahan keadaan suatu objek pada sistem.<br><br>f. Communication diagram<br>Communication diagram yaitu salah satu jenis diagram pada UML yang dapat menggamabarkan tahapan terjadinya suatu aktivitas dan diagram ini juga menggambarkan interaksi antara objek yang ada pada sistem. Hampir sama seperti sequence diagram akan tetapi communication diagram lebih menekankan kepada peranan masing-masing objek pada sistem.<br><br>g. Deployment diagram<br>Deployment diagram yaitu salah satu diagram pada UML yang menunjukan tata letak suatu sistem secara fisik, dapat juga dikatakan untuk menampilkan bagian-bagian softwere yang terdapat pada hardwere dan digunakan untuk menerapkan suatu sistem dan hubungan antara komponen hardwere. Jadi Deployment diagram intinya untuk menunjukan letak softwere pada hardwere yang digunakan sistem.<br><br>h. Component diagram<br>Component diagram yaitu salah satu jenis diagram pada UML yang menggambarkan softwere pada suatu sistem. Component diagram merupakan penerapan softwere dari satu ataupun lebih class, dan biasanya berupa file data atau .exe, source kode, table, dokumen dsb.<br><br>i. Object diagram<br>Object diagram yaitu salah satu jenis diagram pada UML yang menggambarkan objek-objek pada suatu sistem dan hubungan antarnya.<br><br>j. Composite structure diagram<br>Composite structure diagram yaitu salah satu jenis diagram pada UML yang menggambarkan struktur internal dari penklasifikasian (class, component atau use case) dan termasuk titik-titik interaksi penklasifikasian kebagian lainnya dari suatu sistem. Ini hampir mirip seperti class diagram akan tetapi composite structure diagram menggambarkan bagian-bagian dari individu kelas saja bukan semua kelas.<br><br>k. Interaction Overview Diagram<br>Interaction Overview diagram yaitu salah satu jenis diagram pada UML yang berguna untuk men-visualisasikan kerjasama dan hubungan antara activity diagram dengan sequence diagram.<br><br>l. Package diagram<br>Package diagram yaitu salah satu jenis diagram pada UML digunakan untuk mengelompokan kelas dan juga menunjukan bagaimana elemen model akan disusun serta mengambarkan ketergantungan antara paket-paket.<br><br>m. Diagram Timing<br>Diagram timing yaitu salah satu jenis diagram pada UML yang disebut sebagai bentuk lain dari interaksi diagram, dimana fokus yang paling utamanya kepada waktu. Diagram timing berguna untuk menunjukan faktor-faktor yang membatasi waktu antara perubahan state terhadap objek yang berbeda."
	},
	{
		"title": "<a>Mengenal Pemrograman Mobile Android</a>",
		"photo": "assets/img/andrologo.jpg",
		"article": "Bicara mengenai Android memang sangat menyenangkan. Banyak hal yang membuat kita penasaran dengan salah satu Sistem Operasi yang satu ini. Dengan fitur-fitur yang sangat canggih yang akan memanjakan anda. Disamping itu, tahukah anda bagaimana perkembangan dan awal mula Sistem Operasi android diaplikasikan pada sebuah  smartphone? Dari mulai android cupcake, android donut, android eclair, android froyo, android gingerbread, android jelly bean, android kitkat, android marshmallow. Kita akan membahas perkembangan android hingga.<br><br>Android didirikan pada 5 November 2007 dan menjadi OS paling populer dan mendominasi pada pengguna smartphone. Ini bukanlah hal yang mudah untuk menjadikan sebuah perangkat smartphone nomor 1 di dunia. Dibutuhkan waktu yang cukup lama untuk menjadikan sebuah ponsel pintar idaman seperti saat ini. Tidak hanya berhenti di situ, android berkembang dengan cepat dengan versi yang berbeda pula dengan fitur yang lebih canggih. Dari android Cupcake version 1.5 yang pertama dengan fitur yang menarik pada zamannya hingga Marshmallow version 6.0 yang merupakan versi terbaru pada tahun 2015 ini.<br><br>Perkembangan android hingga versi 6.0 marshmallow<br><br>1.Android Cupcake version 1.5<br>Android mempunyai alpha dan beta untuk T-mobile’s G1 sebelum di rilis. Cupcake adalah nama versi pertama OS android ini. Dari versi pertama ini android menyuguhkan fitur yang menyenangkan. Anda dapat mengupload video ke youtube, atau foto ke picasa dilengkapi widget yang mempermudah anda dalam mengakses sebuah fitur. Android juga mengaplikasikan virtual keyboard yang menjadikan pengalaman pertama menyenangkan bagi penggunanya.<br>Android membuat T-mobile G1 menjadi sesuatu yang menarik hingga tahun 2009. Ini hanyalah awal yang sederhana, android mempunyai pekerjaan untuk menjadikan sebuah OS yang lebih canggih.<br><br>2.Android Donut version 1.6<br>Dengan hadirnya android donut, banyak pengguna mulai meninggalkan versi OS android sebelumnya. Android melakukan pembaruan dan menambahkan fitur baru di versi 1.6 ini, yaitu text-to speech dan kompatibilitas CDMA (halo verizon). Pembaruan ini mulai di aplikasikan di semua headset sekitar Oktober 2009.<br><br>3.Android Eclair version 2.0<br>Untuk Eclair, kamera mendapat sedikit TLC dengan beberapa dukungan yang sangat dibutuhkan seperti: flash, digital zoom, dan fitur white balance dan bagaimana dengan tampilan live wallpaper. Google juga menempatkan beberapa pemikiran ke dalam smart keyboard yang bisa pilih nama kontak sebagai saran. Ini bukanlah update terbesar dalam sejarah Android, tapi mungkin salah satu pembaruan yang lebih nikmat bagi penggunanya saat itu.<br><br>4.Android Froyo version 2.2<br>Dengan Froyo, akan menambah kecepatan mengakses perangkat android anda.Gizmodo Matt Buchanan mengatakan tentang pembaruan Android terbaru: “Meningkatkan kecepatan pada 2,2 fantastis, tapi apa yang membuat update Froyo  benar-benar hebat? Adalah bahwa ia mengencangkan baut semua di seluruh platform yang telah berkembang menjadi produk nyata, pada tingkat yang sangat berbeda dari tahun pertama ... android 2.2 adalah versi pertama Android yang terasa benar-benar lengkap.ia melakukan seperti seharusnya dan memiliki sebagian besar fitur yang semestinya. Ini tidak cukup pada titik ibu saya bisa menggunakannya tanpa kurva belajar genting, tetapi Anda dapat melihat bagaimana hal itu akan menjadi lebih baik. Ini aman untuk mengatakan bahwa dengan Froyo, Android telah menjadi sesuatu yang kebanyakan orang benar-benar dapat menggunakan-dan cinta.”<br>Desain masih sedikit kikuk dibandingkan dengan kompetisi lebih ramping dan elegan, tetapi hal-hal sederhana seperti menambahkan dermaga bawah untuk akses cepat ke dialer dan aplikasi drawer mulai menunjukkan bagaimana Android membuat merangkak lambat ke arah untuk membuat lebih nyaman untuk penggunanya.<br><br>5.Android Gingerbread version 2.3<br>Di mana beberapa update terakhir telah meningkatkan fungsi, Google akhirnya mengambil waktu sejenak untuk melihat bentuk pada akhir 2010. antarmuka pengguna yang dirombak dengan tema gelap yang juga terus kecepatan uptick Android. Tapi itu tidak berarti fitur baru benar-benar disertakan. Android menambahkan dukungan untuk NFC, download manager yang super berguna, dan bahkan hal-hal sederhana seperti memperbaiki fitur copy dan paste.<br>Sayangnya, ini adalah ketika software menguliti berada dalam ayunan dan saham Android mulai surut ke belakang. Hanya segelintir handset, seperti Google Nexus S, Nexus One, dan G2 T-Mobile, bahkan melihat perubahan ini seperti yang dirancang di atas.<br><br>6.Android Honeycomb version 3.0<br>Honeycomb lebih terfokus pada satu hal dan hal itu adalah tablet. IPad dirilis hanya beberapa bulan sebelumnya pada  2010, dan Android diperlukan sebuah OS yang bisa bersaing dalam faktor bentuk yang lebih besar tidak cocok untuk saku Anda. Ini termasuk apa yang disebut Google Holographic interface dan keyboard lebih intuitif untuk perangkat yang lebih besar.<br><br>7.Android Ice Cream Sandwich version 4.0<br>ICS reorientasi ke arah ponsel dengan update interface dan pembaruan lengkap tombol hardware. Dengan actionbar dan menambahkan tombol recent apps (bagaimana jika kita hidup tanpa itu ?!). Desain yang benar-benar merger dari Android tablet OS (Honeycomb) dan OS mobile (Gingerbread, Froyo, dll). Aplikasi yang lebih kuat, multitasking depan dan tengah, dan Anda bisa mulai benar-benar melihat kekuatan-kelas komputer yang sedang dikemas dalam smartphone. Bahkan, kami sangat terkesan bahwa kita menyebutnya Upgrade Android paling signifikan sampai saat ini.<br><br>8.Android Jellybean version 4.1<br>GOOGLE NOW! Serius, itu fitur favorit saya dari Android dan rilis di mana saya mulai melihat iPhone 3GS saya yang kurang menyukainya. Jellybean super-improved voice assistant yang ditingkatkan ketika mencari dan pemberitahuan akhirnya lebih smooth, menawarkan konteks yang lebih dari menu drop-down.<br>Homescreen juga mendapat perubahan dan sekarang widget bisa diubah ukurannya dan ditempatkan di mana saja. Android lebih mudah disesuaikan dan canggih dari sebelumnya.<br><br>9.Android Kitkat version 4.4<br>Lebih dari satu tahun sampai Android pindah dan merilis versi berikutnya (meskipun Jellybean itu terus ditingkatkan hingga musim panas 2013) dan meluncurkan KitKat pembaruan dengan Nexus 5 pada Halloween tahun 2013. Google Now sekarang lebih baik dari sebelumnya dengan beberapa kemampuan prescient abilities yang mencoba untuk menebak apa yang pengguna inginkan sebelum mereka bertanya, dan Hangouts ditingkatkan dengan beberapa kemampuan SMS yang sangat dibutuhkan.<br><br>Yang paling penting, KitKat OS mempunyai kecepatan akses, yang hanya dengan 512MB RAM bisa menjalankan OS dengan lancar. Ini berguna untuk mendorong Android ke pasar ponsel murah dengan Salah satu program Android yang hampir sempurna.<br><br>10.Android Lolipop version 5.0<br>Hello Lollipop dan halo modern Android. Klaim terbesar Lollipop untuk ketenaran adalah reimagining dramatis dari sistem operasi Android yang mulai kembali dengan Ice Cream Sandwich. Ikon, animasi, dan menu multitasking yang sepenuhnya diperbarui dengan pendekatan Material Desain Google, dan lockscreen Android menjadi jauh lebih berguna dengan integrasi pemberitahuan yang lebih baik. Google terus mengembangkan Google Now untuk pengembang pihak ketiga dan untungnya menambahkan mode diam kembali untuk pemberitahuan.<br><br>11.Android marshmallow version 6.0<br>Dan kita akhirnya tiba di Android Marshmallow, yang semua tentang pengembangan dan tidak begitu banyak makeover. Tapi itu tidak dengan beberapa tambahan mengagumkan, termasuk cara baru menangani izin aplikasi, dukungan sensor sidik jari baru dan ditingkatkan Google Now, dan legal. Juga memperpanjang waktu penggunaan baterai Google dengan Doze dan bundling di Sensor Android Hub di smartphone terbaru Nexus, yang berarti Anda akan mendapat daya tahan baterai seharian tanpa perlu mengeluarkan kabel pengisian.<br><br>"
	}
]